vm_vs_docker_benchmark/results/disk_test_docker.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 8MiB each
1GiB total file size
Block size 16KiB
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing sequential read test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      187595.31
    writes/s:                     0.00
    fsyncs/s:                     0.00

Throughput:
    read, MiB/s:                  2931.18
    written, MiB/s:               0.00

General statistics:
    total time:                          10.0003s
    total number of events:              1878103

Latency (ms):
         min:                                    0.00
         avg:                                    0.01
         max:                                   11.49
         95th percentile:                        0.01
         sum:                                 9477.77

Threads fairness:
    events (avg/stddev):           1878103.0000/0.00
    execution time (avg/stddev):   9.4778/0.00